mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf46xn/mb9bf46xn.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "DSTC" -->
    <peripheral>
      <name>DSTC</name>
      <description>DSTC registers</description>
      <version>A</version>
      <groupName>DSTC</groupName>
      <baseAddress>0x40061000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0xB0</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "DSTC" -->
      <interrupt>
        <name>DSTC</name>
        <value>91</value>
      </interrupt>
      <!-- INTERRUPT "DSTC_HW" -->
      <interrupt>
        <name>DSTC_HW</name>
        <value>112</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "DESTP" -->
        <register>
          <name>DESTP</name>
          <description>Descriptor top address Register [BHW]</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "HWDESP" -->
        <register>
          <name>HWDESP</name>
          <description>Hardware DES pointer Register [BHW]</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFF00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HWDESP" -->
            <field>
              <name>HWDESP</name>
              <description>HWDESP</description>
              <msb>29</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CHANNEL" -->
            <field>
              <name>CHANNEL</name>
              <description>CHANNEL</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CMD" -->
        <register>
          <name>CMD</name>
          <description>Command Register [B]</description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x01</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "CFG" -->
        <register>
          <name>CFG</name>
          <description>Configuration Register [B]</description>
          <addressOffset>0x9</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x40</resetValue>
          <resetMask>0x7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SWPR" -->
            <field>
              <name>SWPR</name>
              <description>Software transfer priority</description>
              <msb>6</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ESTE" -->
            <field>
              <name>ESTE</name>
              <description>Error stop enable</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RBDIS" -->
            <field>
              <name>RBDIS</name>
              <description>Read skip buffer disable</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ERINTE" -->
            <field>
              <name>ERINTE</name>
              <description>Error interrupt enable</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SWINTE" -->
            <field>
              <name>SWINTE</name>
              <description>Software interrupt enable</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SWTR" -->
        <register>
          <name>SWTR</name>
          <description>Software trigger Register [H]</description>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SWST" -->
            <field>
              <name>SWST</name>
              <description>Software status</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SWREQ" -->
            <field>
              <name>SWREQ</name>
              <description>Software request</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SWDESP" -->
            <field>
              <name>SWDESP</name>
              <description>Software DES pointer</description>
              <msb>13</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MONERS" -->
        <register>
          <name>MONERS</name>
          <description>Transfer Error Status Monitor Register [BHW]</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFFF5F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EDESP" -->
            <field>
              <name>EDESP</name>
              <description>Error DES pointer</description>
              <msb>29</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ECH" -->
            <field>
              <name>ECH</name>
              <description>Error hardware channel</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EHS" -->
            <field>
              <name>EHS</name>
              <description>Error hardware software</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ESTOP" -->
            <field>
              <name>ESTOP</name>
              <description>Error stop</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DER" -->
            <field>
              <name>DER</name>
              <description>Double error</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EST" -->
            <field>
              <name>EST</name>
              <description>Error status</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
