mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf46xn/mb9bf46xn.svd
        <!-- REGISTER "INTR" -->
        <register>
          <name>INTR</name>
          <description>CAN Interrupt Register [BHW]</description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INTID" -->
            <field>
              <name>INTID</name>
              <description>Interrupt Code</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TESTR" -->
        <register>
          <name>TESTR</name>
          <description>CAN Test Register [BHW]</description>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x00FC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RX" -->
            <field>
              <name>RX</name>
              <description>Rx pin monitor bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TX" -->
            <field>
              <name>TX</name>
              <description>TX pin control bit</description>
              <msb>6</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LBACK" -->
            <field>
              <name>LBACK</name>
              <description>Loop back mode</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SILENT" -->
            <field>
              <name>SILENT</name>
              <description>Silent mode</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BASIC" -->
            <field>
              <name>BASIC</name>
              <description>Basic mode</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "BRPER" -->
        <register>
          <name>BRPER</name>
          <description>CAN Prescaler Extension Register [BHW]</description>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x000F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BRPE" -->
            <field>
              <name>BRPE</name>
              <description>Baud rate prescaler extension bit</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF1CREQ" -->
        <register>
          <name>IF1CREQ</name>
          <description>IF1 Command Request Register [BHW]</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0001</resetValue>
          <resetMask>0x80FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BUSY" -->
            <field>
              <name>BUSY</name>
              <description>Busy flag bit</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MESSAGENUMBER" -->
            <field>
              <name>MESSAGENUMBER</name>
              <description>Message number</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF1CMSK" -->
        <register>
          <name>IF1CMSK</name>
          <description>IF1 Command Mask Register [BHW]</description>
          <addressOffset>0x12</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WR_RD" -->
            <field>
              <name>WR_RD</name>
              <description>Writing or reading control bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MASK" -->
            <field>
              <name>MASK</name>
              <description>Mask data update bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ARB" -->
            <field>
              <name>ARB</name>
              <description>Arbitration data update bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CONTROL" -->
            <field>
              <name>CONTROL</name>
              <description>Control data update bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CIP" -->
            <field>
              <name>CIP</name>
              <description>Interrupt clear bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "NEWDAT" -->
            <field>
              <name>NEWDAT</name>
              <description>Message transmission request bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATAA" -->
            <field>
              <name>DATAA</name>
              <description>Data 0-3 update bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATAB" -->
            <field>
              <name>DATAB</name>
              <description>Data 4-7 update bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
